In [66]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm

E:\anaconda install\lib\site-packages\statsmodels\compat\pandas.py:56: FutureWarning: The pandas.core.datetools module is deprecated and will be removed in a future version. Please use the pandas.tseries module instead.
  from pandas.core import datetools

**gather the data**

In [2]:
#upload the dataset
df=pd.read_csv('E:/my_work_my_work/B I UDEMY COURSE/final_project/Absenteeism-data.csv')
df.head(6)

,ID,Reason for Absence,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,11,26,07/07/2015,289,36,33,239.554,30,1,2,1,4
1,36,0,14/07/2015,118,13,50,239.554,31,1,1,0,0
2,3,23,15/07/2015,179,51,38,239.554,31,1,0,0,2
3,7,7,16/07/2015,279,5,39,239.554,24,1,2,0,4
4,11,23,23/07/2015,289,36,33,239.554,30,1,2,1,2
5,3,23,10/07/2015,179,51,38,239.554,31,1,0,0,2

In [3]:
#take copy from the orginal dataframe
df_1=df.copy()

In [4]:
df_1.head(5)

,ID,Reason for Absence,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,11,26,07/07/2015,289,36,33,239.554,30,1,2,1,4
1,36,0,14/07/2015,118,13,50,239.554,31,1,1,0,0
2,3,23,15/07/2015,179,51,38,239.554,31,1,0,0,2
3,7,7,16/07/2015,279,5,39,239.554,24,1,2,0,4
4,11,23,23/07/2015,289,36,33,239.554,30,1,2,1,2

In [5]:
df.shape

(700, 12)

**assess the dataset**

In [6]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 12 columns):
ID                           700 non-null int64
Reason for Absence           700 non-null int64
Date                         700 non-null object
Transportation Expense       700 non-null int64
Distance to Work             700 non-null int64
Age                          700 non-null int64
Daily Work Load Average      700 non-null float64
Body Mass Index              700 non-null int64
Education                    700 non-null int64
Children                     700 non-null int64
Pets                         700 non-null int64
Absenteeism Time in Hours    700 non-null int64
dtypes: float64(1), int64(10), object(1)
memory usage: 65.7+ KB

In [7]:
df_1.dtypes

ID                             int64
Reason for Absence             int64
Date                          object
Transportation Expense         int64
Distance to Work               int64
Age                            int64
Daily Work Load Average      float64
Body Mass Index                int64
Education                      int64
Children                       int64
Pets                           int64
Absenteeism Time in Hours      int64
dtype: object

**clean the dataset**

drop the id column

In [8]:
#code
df_1=df_1.drop(['ID'],axis=1)

In [9]:
#test
df_1.head(3)

,Reason for Absence,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,26,07/07/2015,289,36,33,239.554,30,1,2,1,4
1,0,14/07/2015,118,13,50,239.554,31,1,1,0,0
2,23,15/07/2015,179,51,38,239.554,31,1,0,0,2

working with Reason for Absence column

In [10]:
df_1['Reason for Absence'].head()

0    26
1     0
2    23
3     7
4    23
Name: Reason for Absence, dtype: int64

In [11]:
df_1['Reason for Absence'].min()

0

In [12]:
df_1['Reason for Absence'].max()

28

In [13]:
df_1['Reason for Absence'].unique()

array([26,  0, 23,  7, 22, 19,  1, 11, 14, 21, 10, 13, 28, 18, 25, 24,  6,
       27, 17,  8, 12,  5,  9, 15,  4,  3,  2, 16], dtype=int64)

In [14]:
len(df_1['Reason for Absence'].unique())

28

In [15]:
sorted(df_1['Reason for Absence'].unique())

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28]

In [16]:
reason_column=pd.get_dummies(df_1['Reason for Absence'])
reason_column.head(6)

,0,1,2,3,4,5,6,7,8,9,...,18,19,21,22,23,24,25,26,27,28
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,1,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
3,0,0,0,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
5,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0

In [17]:
#drop column 0
reason_column=reason_column.drop([0],axis=1)
reason_column.head(3)

,1,2,3,4,5,6,7,8,9,10,...,18,19,21,22,23,24,25,26,27,28
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0

In [18]:
reason_column.columns.values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 21, 22, 23, 24, 25, 26, 27, 28], dtype=int64)

In [19]:
df_1=df_1.drop(['Reason for Absence'],axis=1)
df_1.head()

,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,07/07/2015,289,36,33,239.554,30,1,2,1,4
1,14/07/2015,118,13,50,239.554,31,1,1,0,0
2,15/07/2015,179,51,38,239.554,31,1,0,0,2
3,16/07/2015,279,5,39,239.554,24,1,2,0,4
4,23/07/2015,289,36,33,239.554,30,1,2,1,2

In [20]:
#GROUPING REASONS
reason_one=reason_column.loc[:, '1':'14'].max(axis=1)
reason_two=reason_column.loc[:, '15':'17'].max(axis=1)
reason_three=reason_column.loc[:, '18':'21'].max(axis=1)
reason_four=reason_column.loc[:, '22':].max(axis=1)

In [21]:
reason_four.head()

0    1
1    0
2    1
3    0
4    1
dtype: uint8

concatenation column value

In [22]:
df_1=pd.concat([df_1,reason_one,reason_two,reason_three,reason_four],axis=1)

In [23]:
df_1.head()

,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours,0,1,2,3
0,07/07/2015,289,36,33,239.554,30,1,2,1,4,0,0,0,1
1,14/07/2015,118,13,50,239.554,31,1,1,0,0,0,0,0,0
2,15/07/2015,179,51,38,239.554,31,1,0,0,2,0,0,0,1
3,16/07/2015,279,5,39,239.554,24,1,2,0,4,1,0,0,0
4,23/07/2015,289,36,33,239.554,30,1,2,1,2,0,0,0,1

rename the columns

In [24]:
df_1.columns.values

array(['Date', 'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours', 0, 1, 2, 3], dtype=object)

In [25]:
new_columns=['Date', 'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours', 'reason_1','reason_two','reason_three','reason_four']

In [26]:
df_1.columns=new_columns

In [27]:
df_1.head()

,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours,reason_1,reason_two,reason_three,reason_four
0,07/07/2015,289,36,33,239.554,30,1,2,1,4,0,0,0,1
1,14/07/2015,118,13,50,239.554,31,1,1,0,0,0,0,0,0
2,15/07/2015,179,51,38,239.554,31,1,0,0,2,0,0,0,1
3,16/07/2015,279,5,39,239.554,24,1,2,0,4,1,0,0,0
4,23/07/2015,289,36,33,239.554,30,1,2,1,2,0,0,0,1

reorder columns

In [28]:
reorder_columns=[ 'reason_1','reason_two','reason_three','reason_four','Date', 'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education',
       'Children', 'Pets', 'Absenteeism Time in Hours']

In [29]:
df_1=df_1[reorder_columns]

In [30]:
df_1.head()

,reason_1,reason_two,reason_three,reason_four,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,0,0,0,1,07/07/2015,289,36,33,239.554,30,1,2,1,4
1,0,0,0,0,14/07/2015,118,13,50,239.554,31,1,1,0,0
2,0,0,0,1,15/07/2015,179,51,38,239.554,31,1,0,0,2
3,1,0,0,0,16/07/2015,279,5,39,239.554,24,1,2,0,4
4,0,0,0,1,23/07/2015,289,36,33,239.554,30,1,2,1,2

CREATE CHECKPOINT

In [31]:
df_reason_mod=df_1.copy()

In [32]:
df_reason_mod.head(3)

,reason_1,reason_two,reason_three,reason_four,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,0,0,0,1,07/07/2015,289,36,33,239.554,30,1,2,1,4
1,0,0,0,0,14/07/2015,118,13,50,239.554,31,1,1,0,0
2,0,0,0,1,15/07/2015,179,51,38,239.554,31,1,0,0,2

WORK WITH DATE COLUMN

In [34]:
type(df_reason_mod['Date'][0])

str

In [35]:
df_reason_mod['Date']=pd.to_datetime(df_reason_mod['Date'],format='%d/%m/%Y')

In [36]:
df_reason_mod['Date'].head()

0   2015-07-07
1   2015-07-14
2   2015-07-15
3   2015-07-16
4   2015-07-23
Name: Date, dtype: datetime64[ns]

Retrieving the Month Value From the "Date" Column

In [37]:
month_list=[]

In [38]:
for i in range(700):
    month_list.append(df_reason_mod['Date'][i].month)

In [39]:
df_reason_mod['month_value']=month_list

In [41]:
df_reason_mod.head(3)

,reason_1,reason_two,reason_three,reason_four,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours,month_value
0,0,0,0,1,2015-07-07,289,36,33,239.554,30,1,2,1,4,7
1,0,0,0,0,2015-07-14,118,13,50,239.554,31,1,1,0,0,7
2,0,0,0,1,2015-07-15,179,51,38,239.554,31,1,0,0,2,7

EXTRACT THE DAY OF THE WEEK

In [42]:
def extract_day(day_value):
    return day_value.weekday()

In [43]:
df_reason_mod['day_of_week']=df_reason_mod['Date'].apply(extract_day)

In [44]:
df_reason_mod.head(3)

,reason_1,reason_two,reason_three,reason_four,Date,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours,month_value,day_of_week
0,0,0,0,1,2015-07-07,289,36,33,239.554,30,1,2,1,4,7,1
1,0,0,0,0,2015-07-14,118,13,50,239.554,31,1,1,0,0,7,1
2,0,0,0,1,2015-07-15,179,51,38,239.554,31,1,0,0,2,7,2

CREATE A NEW CHECKPOINT

In [45]:
df_dataframe=df_reason_mod.copy()

Drop date column

In [48]:
df_dataframe=df_dataframe.drop(['Date'],axis=1)

In [49]:
df_dataframe.head(3)

,reason_1,reason_two,reason_three,reason_four,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours,month_value,day_of_week
0,0,0,0,1,289,36,33,239.554,30,1,2,1,4,7,1
1,0,0,0,0,118,13,50,239.554,31,1,1,0,0,7,1
2,0,0,0,1,179,51,38,239.554,31,1,0,0,2,7,2

rearrange columns

In [50]:
df_dataframe.columns

Index(['reason_1', 'reason_two', 'reason_three', 'reason_four',
       'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education', 'Children',
       'Pets', 'Absenteeism Time in Hours', 'month_value', 'day_of_week'],
      dtype='object')

In [56]:
new_new_column=['reason_1', 'reason_two', 'reason_three', 'reason_four','month_value','day_of_week',
       'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education', 'Children',
       'Pets', 'Absenteeism Time in Hours']

In [57]:
df_dataframe=df_dataframe[new_new_column]

In [58]:
df_dataframe.head(3)

,reason_1,reason_two,reason_three,reason_four,month_value,day_of_week,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,0,0,0,1,7,1,289,36,33,239.554,30,1,2,1,4
1,0,0,0,0,7,1,118,13,50,239.554,31,1,1,0,0
2,0,0,0,1,7,2,179,51,38,239.554,31,1,0,0,2

WORK WITH EDUCATION COLUMN

In [59]:
df_dataframe['Education'].unique()

array([1, 3, 2, 4], dtype=int64)

In [60]:
df_dataframe['Education'].value_counts()

1    583
3     73
2     40
4      4
Name: Education, dtype: int64

In [61]:
df_dataframe['Education']=df_dataframe['Education'].map({1:0,2:1,3:1,4:1})

In [62]:
df_dataframe['Education'].unique()

array([0, 1], dtype=int64)

In [63]:
df_dataframe.head(4)

,reason_1,reason_two,reason_three,reason_four,month_value,day_of_week,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours
0,0,0,0,1,7,1,289,36,33,239.554,30,0,2,1,4
1,0,0,0,0,7,1,118,13,50,239.554,31,0,1,0,0
2,0,0,0,1,7,2,179,51,38,239.554,31,0,0,0,2
3,1,0,0,0,7,3,279,5,39,239.554,24,0,2,0,4

FINAL CHECKPOINT

In [64]:
data_preprocessing=df_dataframe.copy()

In [65]:
data_preprocessing['intercept']=1

In [71]:
data_preprocessing['probiliaty']=sm.OLS(data_preprocessing['Absenteeism Time in Hours'],data_preprocessing[['intercept','reason_1', 'reason_two', 'reason_three', 'reason_four',
       'Transportation Expense', 'Distance to Work', 'Age',
       'Daily Work Load Average', 'Body Mass Index', 'Education', 'Children',
       'Pets']])

In [72]:
data_preprocessing.head(5)

,reason_1,reason_two,reason_three,reason_four,month_value,day_of_week,Transportation Expense,Distance to Work,Age,Daily Work Load Average,Body Mass Index,Education,Children,Pets,Absenteeism Time in Hours,intercept,probiliaty
0,0,0,0,1,7,1,289,36,33,239.554,30,0,2,1,4,1,<statsmodels.regression.linear_model.OLS objec...
1,0,0,0,0,7,1,118,13,50,239.554,31,0,1,0,0,1,<statsmodels.regression.linear_model.OLS objec...
2,0,0,0,1,7,2,179,51,38,239.554,31,0,0,0,2,1,<statsmodels.regression.linear_model.OLS objec...
3,1,0,0,0,7,3,279,5,39,239.554,24,0,2,0,4,1,<statsmodels.regression.linear_model.OLS objec...
4,0,0,0,1,7,3,289,36,33,239.554,30,0,2,1,2,1,<statsmodels.regression.linear_model.OLS objec...

In [ ]:
data_preprocessing